/* Работа с логическими переменными */

/* 1. Если переменная test равна true, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при test, равном true, false. Напишите два варианта скрипта - с короткой записью и с длинной. */

'use strict'

let test = true ;
if (test) {
    alert ('Верно');
} else {
    alert ('Неверно');
};

/* 2. Если переменная test не равна true, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при test, равном true, false. Напишите два варианта скрипта - с короткой записью и с длинной. */

// let test = 0 ;
// if (test != true) {
//     alert ('Верно');
// } else {
//     alert ('Неверно');
// };

